[
  {
    "title": "Aortic Surgery | ProMedica",
    "content": {
      "articleContent": "\n\t\t<div class=\"row\"><!--<div class=\"col-xs-12 col-sm-12 col-md-7 col-lg-7\" style=\"float: right;\"><img src=\"https://via.placeholder.com/1750x855\" alt=\"Placeholder\" class=\"img-breakout\" /></div>-->\n\t\t<div class=\"col-xs-12 col-sm-12 col-md-12 col-lg-12\">\n\t\t<h2>We're Here to Protect Your Heart</h2>\n\t\t<p>As your largest vessel, your aorta performs the vital job of delivering oxygenated blood from your heart to the rest of your body. But over time, it can balloon, separate or tear. These problems put you at risk for an aortic rupture that needs medical attention right away.</p>\n\t\t<p>At ProMedica, our cardiothoracic team stands ready to care for you — day-to-day and in emergencies. They can diagnose and monitor your aortic heart disease and can recommend when you may need aortic surgery.</p>\n\t\t</div>\n\t\t</div>\n\t",
      "about": null,
      "overview": "<a name=\"overview\"></a>\n\t\t<div>\n\t\t<h2 class=\"alt\">Overview</h2>\n\t\t<hr class=\"divider-green\">\n\t\t<p>There are two conditions that lead to most aortic procedures: aortic dissections and thoracic aortic aneurysms.</p>\n\t\t<p>Aortic dissection surgery is considered an emergency medical procedure. This method allows your surgeon to repair a tear in the wall of your aorta, which is your body’s main artery.</p>\n\t\t<p>Thoracic aortic aneurysm surgery repairs, removes or stents an aortic aneurysm. But not all aortic aneurysms need surgery. It depends on the aneurysm’s size, location and growth rate.</p>\n\t\t<p>Common types of aortic aneurysms include:</p>\n\t\t<ul>\n\t\t<li>Aortic root.</li>\n\t\t<li>Diagnosis of and treatment for sexually transmitted diseases.</li>\n\t\t<li>Ascending aortic arch.</li>\n\t\t<li>Transverse aortic arch.</li>\n\t\t<li>Descending aortic arch.</li>\n\t\t</ul>\n\t\t<h3>Marfan Syndrome</h3>\n\t\t<p>This is an inherited disorder that impacts the connective tissue, which supports and anchors your organs and other parts of your body. Marfan syndrome can lead to aortic valve problems. If you have a family history of Marfan syndrome, ask your doctor to recommend the best way to monitor your aortic health.</p>\n\t\t</div>\n\t\t",
      "treatment": null,
      "providers": [],
      "moreProviders": null,
      "locations": [],
      "moreLocations": "https://www.promedica.org/find-locations/location-results?ServicesId=167"
    }
  }
]