[
  {
    "id": 3,
    "title": "13abc: ProMedica Toledo Hospital receives national recognition by Healthgrades",
    "url": "https://www.promedica.org/newsroom/news/2023/13abc-promedica-toledo-hospital-receives-national-recognition-by-healthgrades",
    "content": "<br />13abc: ProMedica Toledo Hospital receives national recognition by Healthgrades<br /><img src='/assets/images/news/news/2023/13abc-promedica-toledo-hospital-receives-national-recognition-by-healthgrades.png' alt='13abc: ProMedica Toledo Hospital receives national recognition by Healthgrades' /><br />ProMedica Toledo Hospital was recognized among the top 1% of hospitals in the nation.<br />"
  },
  {
    "id": 59,
    "title": "The Blade: Body mechanics: Professionals tell you what you need to know about physical therapy",
    "url": "https://www.promedica.org/newsroom/news/2022/the-blade-body-mechanics-professionals-tell-you-what-you-need-to-know-about-physical-therapy",
    "content": "<br />The Blade: Body mechanics: Professionals tell you what you need to know about physical therapy<br /><img src='/assets/images/news/news/2022/physical-therapy.jpg' alt='The Blade: Body mechanics: Professionals tell you what you need to know about physical therapy' /><br />Tina Ball, physical therapist for ProMedica, explains techniques used by physical therapists.<br />"
  },
  {
    "id": 264,
    "title": "13abc: African Americans and heart disease",
    "url": "https://www.promedica.org/newsroom/news/2022/13abc-african-americans-and-heart-disease",
    "content": "<br />13abc: African Americans and heart disease<br /><img src='/assets/images/news/news/2022/13abc-african-americans-and-heart-disease.png' alt='13abc: African Americans and heart disease' /><br />Dr. Traci Watkins, ProMedica physician, comments on factors that contribute to increased risk of heart disease for African Americans.<br />"
  },
  {
    "id": 339,
    "title": "WTOL 11 Acupuncture Toledo, Ohio (OH), ProMedica Health System",
    "url": "https://www.promedica.org/newsroom/news/2021/wtol-11-acupuncture",
    "content": "<br />WTOL 11 AcupunctureWTOL 11 Acupuncture<br /><img src='/assets/images/news/news/potential-benefits-of-acupuncture.png' alt='WTOL 11 Acupuncture' /><br />Kylie Study, M.Sc., MSTOM, Diplo. OM, L.Ac, ProMedica Natural Wellness licensed acupuncturist, demonstrates how acupuncture works and what benefits it can potentially have.<br />"
  },
  {
    "id": 406,
    "title": "13abc Solheim Cup flower boxes to beautify downtown Toledo",
    "url": "https://www.promedica.org/newsroom/news/2021/13abc-solheim-cup-flower-boxes-to-beautify-downtown-toledo",
    "content": "<br />13abc Solheim Cup flower boxes to beautify downtown Toledo13abc Solheim Cup flower boxes to beautify downtown Toledo<br /><img src='/assets/images/news/news/solheimsponsorships.jpg' alt='13abc Solheim Cup flower boxes to beautify downtown Toledo' /><br />Christi Ansberg, vice president of the ProMedica philanthropy operations, shares how businesses or individuals can sponsor a custom-built box that will feature fresh flowers and a special tee marker with your business logo.<br />"
  },
  {
    "id": 408,
    "title": "13abc Tax credit catalyzes UpTown tech transformation Toledo, Ohio (OH), ProMedica Health System",
    "url": "https://www.promedica.org/newsroom/news/2021/13abc-tax-credit-catalyzes-uptown-tech-transformation",
    "content": "<br />13abc Tax credit catalyzes UpTown tech transformation13abc Tax credit catalyzes UpTown tech transformation<br /><img src='/assets/images/news/news/jeffersoncenterrandy.jpg' alt='13abc Tax credit catalyzes UpTown tech transformation' /><br />The Ohio Development Services Agency, announced that ProMedica and California tech company Bitwise will receive a $4.5 million tax credit to fund the Jefferson Center project.<br />"
  },
  {
    "id": 478,
    "title": "ProMedica participates in worldwide COVID-19 study",
    "url": "https://www.promedica.org/newsroom/news/2021/nbc-24-promedica-participates-in-worldwide-covid-19-study",
    "content": "<br />ProMedica participates in worldwide COVID-19 studyNBC 24: ProMedica participates in worldwide COVID-19 study<br /><img src='/assets/images/news/press-releases/covid-vaccine.jpg' alt='NBC 24: ProMedica participates in worldwide COVID-19 study' /><br />ProMedica announced that it was one of 69 U.S. sites to participate in a worldwide data collection study that determined patients should receive a COVID-19 vaccine before having an elective procedure.<br />"
  },
  {
    "id": 798,
    "title": "Page Not Found Toledo, Ohio (OH), ProMedica Health System",
    "url": "https://www.promedica.org/newsroom/news/hud-promedica-focuses-on-community-development-to-strengthen-health",
    "content": "<br />Page Not Found<br />Our apologies, but the content you have searched for is no longer available.<br /><a href='/'>Go to the ProMedica Home Page</a><br /><a href='/find-a-doctor/'>Search for a Provider</a><br /><a href='/find-locations/'>Search for a Location</a><br /><a href='/services-and-conditions/'>Search for a Service/Condition</a><br />"
  },
  {
    "id": 831,
    "title": "NBC 24: Ways to prevent skin cancer Toledo, Ohio (OH), ProMedica Health System",
    "url": "https://www.promedica.org/newsroom/news/2020/nbc-24-ways-to-prevent-skin-cancer",
    "content": "<br />NBC 24: Ways to prevent skin cancerNBC 24: Ways to prevent skin cancer<br />"
  },
  {
    "id": 1065,
    "title": "HealthLeaders Magazine: Growth Opportunities: How Health Systems Position Themselves Under Pressure Toledo, Ohio (OH), ProMedica Health System",
    "url": "https://www.promedica.org/newsroom/news/2019/healthleaders-magazine-growth-opportunities-how-health-systems-position-themselves-under-pressure",
    "content": "<br />HealthLeaders Magazine: Growth Opportunities: How Health Systems Position Themselves Under PressureHealthLeaders Magazine: Growth Opportunities: How Health Systems Position Themselves Under Pressure<br />"
  },
  {
    "id": 1070,
    "title": "WTOL: Doctor's Orders: Addressing exercise-related aches, especially shoulders Toledo, Ohio (OH), ProMedica Health System",
    "url": "https://www.promedica.org/newsroom/news/2019/wtol-doctors-orders-addressing-exercise-related-aches-especially-shoulders",
    "content": "<br />WTOL: Doctor's Orders: Addressing exercise-related aches, especially shouldersWTOL: Doctor's Orders: Addressing exercise-related aches, especially shoulders<br />"
  },
  {
    "id": 1165,
    "title": "NBC24: ProMedica brings CPR training to six barbershops Toledo, Ohio (OH), ProMedica Health System",
    "url": "https://www.promedica.org/newsroom/news/2019/nbc24-promedica-brings-cpr-training-to-six-barbershops",
    "content": "<br />NBC24: ProMedica brings CPR training to six barbershopsNBC24: ProMedica brings CPR training to six barbershops<br />"
  },
  {
    "id": 1187,
    "title": "WTOL: Camp Fearless helps grieving children Toledo, Ohio (OH), ProMedica Health System",
    "url": "https://www.promedica.org/newsroom/news/2019/wtol-camp-fearless-helps-grieving-children",
    "content": "<br />WTOL: Camp Fearless helps grieving childrenWTOL: Camp Fearless helps grieving children<br />"
  },
  {
    "id": 1416,
    "title": "The Blade: Major gifts boost ProMedica tower, Ebeid Promise Toledo, Ohio (OH), ProMedica Health System",
    "url": "https://www.promedica.org/newsroom/news/2018/the-blade-major-gifts-boost-promedica-tower-ebeid-promise",
    "content": "<br />The Blade: Major gifts boost ProMedica tower, Ebeid PromiseThe Blade: Major gifts boost ProMedica tower, Ebeid Promise<br />"
  },
  {
    "id": 1505,
    "title": "The Daily Telegram: Lenawee County students complete placement program Toledo, Ohio (OH), ProMedica Health System",
    "url": "https://www.promedica.org/newsroom/news/2018/the-daily-telegram-lenawee-county-students-complete-placement-program",
    "content": "<br />The Daily Telegram: Lenawee County students complete placement programThe Daily Telegram: Lenawee County students complete placement program<br />"
  },
  {
    "id": 1560,
    "title": "13abc: FDA approves new drug to prevent chronic migraines Toledo, Ohio (OH), ProMedica Health System",
    "url": "https://www.promedica.org/newsroom/news/2018/13abc-fda-approves-new-drug-to-prevent-chronic-migraines",
    "content": "<br />13abc: FDA approves new drug to prevent chronic migraines13abc: FDA approves new drug to prevent chronic migraines<br />"
  },
  {
    "id": 1567,
    "title": "All ProMedica Sleep Centers Accredited by the American Academy of Sleep Medicine Toledo, Ohio (OH), ProMedica Health System",
    "url": "https://www.promedica.org/newsroom/news/2018/all-promedica-sleep-centers-accredited-by-the-american-academy-of-sleep-medicine",
    "content": "<br />All ProMedica Sleep Centers Accredited by the American Academy of Sleep Medicine All ProMedica Sleep Centers Accredited by the American Academy of Sleep Medicine <br />In May, the <a href='https://aasm.org/'>American Academy of Sleep Medicine (AASM)</a> visited the sleep centers at ProMedica <a href='/location/promedica-bay-park-hospital'>Bay Park</a>, <a href='/location/promedica-fostoria-community-hospital'>Fostoria</a> and <a href='/location/promedica-memorial-hospital'>Memorial</a> Hospitals and all hospitals passed the inspection with no provisos. This means that all ProMedica Sleep Centers are now accredited. <br /><br /><br /><br />“The AASM is the gold standard for accreditation for sleep,” explained Heather Sheehy, ProMedica Sleep Centers system director. “There are 70 standards in which the program is rated, ranging from the physical structure to physician involvement, policies and record keeping.”<br /><br /><br /><br />For patients, the accreditation means that ProMedica Sleep Centers have set and achieved policies and procedures that are in line with best practices in sleep medicine.<br /><br /><br /><br />ProMedica Sleep Centers are located throughout ProMedica’s service area, including <a href='/location/promedica-flower-hospital'>Flower</a>, <a href='/location/promedica-herrick-hospital'>Herrick</a>, <a href='/location/promedica-coldwater-regional-hospital'>Coldwater Regional</a>, <a href='/location/promedica-defiance-regional-hospital'>Defiance Regional </a>and <a href='/location/promedica-monroe-regional-hospital'>Monroe Regional</a> Hospitals, in addition to those mentioned above.<br />The Centers help with common conditions such as sleep apnea, narcolepsy, hypersomnia, periodic limb movement disorder and insomnia. <br /><br /><br /><br />Although there are multiple locations, the Centers are one systematic department, says Sheehy. “They have the same policies, procedures, processes and equipment. Our patients can feel confident going to any facility, knowing that if they or someone they know had a study at another location, the experience would be the same.”<br /><br /><br /><br /><a href='/services-and-conditions/sleep-medicine'>Learn more about ProMedica Sleep Centers.</a><br />"
  },
  {
    "id": 1610,
    "title": "Daily Telegram: Lenawee County board gives OK to hospital bonds Toledo, Ohio (OH), ProMedica Health System",
    "url": "https://www.promedica.org/newsroom/news/2018/daily-telegram-lenawee-county-board-gives-ok-to-hospital-bonds",
    "content": "<br />Daily Telegram: Lenawee County board gives OK to hospital bondsDaily Telegram: Lenawee County board gives OK to hospital bonds<br />"
  },
  {
    "id": 1613,
    "title": "Nonprofit Quarterly: A Partnership to Improve Health through Community Investment Toledo, Ohio (OH), ProMedica Health System",
    "url": "https://www.promedica.org/newsroom/news/2018/nonprofit-quarterly-a-partnership-to-improve-health-through-community-investment",
    "content": "<br />Nonprofit Quarterly: A Partnership to Improve Health through Community Investment Nonprofit Quarterly: A Partnership to Improve Health through Community Investment <br />"
  },
  {
    "id": 1619,
    "title": "ProMedica Home Medical Equipment Moves to Walbridge Toledo, Ohio (OH), ProMedica Health System",
    "url": "https://www.promedica.org/newsroom/news/2018/promedica-home-medical-equipment-moves-to-walbridge",
    "content": "<br />ProMedica Home Medical Equipment Moves to WalbridgeProMedica Home Medical Equipment Moves to Walbridge<br />OREGON, Ohio, March 1, 2018 - ProMedica Home Medical Equipment will move from the campus of ProMedica Bay Park Hospital to a new location in Walbridge on Monday, March 5. The new address will be 30595 Tracy Road.<br />The Walbridge location will offer the same home medical equipment services as Bay Park Hospital but will provide a larger showroom for the comfort and convenience of patients. Hours will remain the same, Monday – Friday, 8 a.m. – 5 p.m. For more information, call 419-382-1262.<br />For more information about ProMedica, visit <a href='/'>www.promedica.org</a>.<br />ProMedica is a mission-based, not-for-profit healthcare organization serving northwest Ohio and southern Michigan. The 13-hospital system has more than 17,900 employees, 2,700 physicians and advanced practice providers with privileges, and more than 920 healthcare providers employed by ProMedica Physicians. Additionally, it offers a health plan, Paramount, which serves 344,000 members including more than 243,000 members in the statewide Medicaid plan. Driven by its Mission to improve your health and well-being, ProMedica offers a full range of diagnostic, medical and surgical specialties in areas such as emergency medicine and trauma, behavioral health, heart and vascular, oncology, orthopaedics, neurology, and women’s and children’s services. The health system has been nationally recognized for its advocacy programs and efforts to raise awareness about hunger as a health issue. For more information about ProMedica, please visit <a href='/about-promedica/'>www.promedica.org/aboutus</a>.<br /><br /><br />###<br /><br /> <br />"
  },
  {
    "id": 1634,
    "title": "ProMedica Weather Cancellations 2/9/18 Toledo, Ohio (OH), ProMedica Health System",
    "url": "https://www.promedica.org/newsroom/news/2018/promedica-weather-cancellations-2-9-18",
    "content": "<br />ProMedica Weather Cancellations 2/9/18ProMedica Weather Cancellations 2/9/18<br />For Immediate Release<br /><br /> <br /><br />Please note: All ProMedica hospitals are OPEN.<br /><br /> <br /><br />The following ProMedica facilities are closed and events are cancelled due to the weather:<br /><br /> <br /><br />•         ProMedica Physician offices in Toledo – Call ahead to confirm your appointment<br />•         ProMedica Physician offices in Michigan – Call ahead to confirm your appointment<br />•          ProMedica Laboratories in Michigan – Call ahead<br />•         ProMedica Herrick Outpatient Mental Health, 502 E. Cummins St., Tecumseh – Closed<br /> For more information about ProMedica, visit <a href='/'>www.promedica.org</a>.<br /><br /><br /><br />ProMedica is a mission-based, not-for-profit healthcare organization serving northwest Ohio and southern Michigan. The 13-hospital system has more than 17,900 employees, 2,700 physicians and advanced practice providers with privileges, and more than 920 healthcare providers employed by ProMedica Physicians. Additionally, it offers a health plan, Paramount, which serves 344,000 members including more than 243,000 members in the statewide Medicaid plan. Driven by its Mission to improve your health and well-being, ProMedica offers a full range of diagnostic, medical and surgical specialties in areas such as emergency medicine and trauma, behavioral health, heart and vascular, oncology, orthopaedics, neurology, and women’s and children’s services. The health system has been nationally recognized for its advocacy programs and efforts to raise awareness about hunger as a health issue. For more information about ProMedica, please visit <a href='/about-promedica/'>www.promedica.org/aboutus</a>.<br /><br /><br /><br />###<br />"
  },
  {
    "id": 1642,
    "title": "ProMedica and Paramount Announce Leadership Changes Toledo, Ohio (OH), ProMedica Health System",
    "url": "https://www.promedica.org/newsroom/news/2018/promedica-and-paramount-announce-leadership-changes",
    "content": "<br />ProMedica and Paramount Announce Leadership ChangesProMedica and Paramount Announce Leadership Changes<br />TOLEDO, Ohio, January 30, 2018 – ProMedica is pleased to announce the following leadership changes, effective March 1.<br /><br /><br /><br />Jack Randolph, president of Paramount Health Insurance, Inc. has been named Chief Information Technology Officer for ProMedica. <br />Randolph has been with ProMedica for 36 years, with 25 of those years at Paramount. Under his leadership, Paramount started the Medicare, Medicaid and Workers' Compensation product lines; acquired numerous companies including Toledo Health Plan, Medical Value Plan, HMS, Advocare, BalaCare, ProComp, and Health Resources Inc.; expanded services into Michigan, West Virginia, Indiana, and other states; and expanded Medicaid and Workers' Comp services statewide in Ohio. All of those accomplishments have helped ProMedica Insurance Corp grow its membership to more than 590,000 and increase its annual revenues to $1.5 billion.<br />Lori Johnston, ProMedica’s outgoing Chief Information Technology Officer, will transition to President of Paramount Health Care, Inc. <br />Johnston has been with ProMedica for 21 years and has held a variety of leadership roles in finance, acute care, post-acute care, ProMedica Physicians Group operations and information technology. She helped grow ProMedica Physicians Group’s provider base and began development of standardized work processes. Most recently, she was instrumental in implementing Epic, a new electronic health record software and improving technical and educational efforts around cybersecurity. <br />For more information about ProMedica, visit <a href='/'>www.promedica.org</a>.<br />ProMedica is a mission-based, not-for-profit healthcare organization serving northwest Ohio and southern Michigan. The 13-hospital system has more than 17,900 employees, 2,700 physicians and advanced practice providers with privileges, and more than 920 healthcare providers employed by ProMedica Physicians. Additionally, it offers a health plan, Paramount, which serves 344,000 members including more than 243,000 members in the statewide Medicaid plan. Driven by its Mission to improve your health and well-being, ProMedica offers a full range of diagnostic, medical and surgical specialties in areas such as emergency medicine and trauma, behavioral health, heart and vascular, oncology, orthopaedics, neurology, and women’s and children’s services. The health system has been nationally recognized for its advocacy programs and efforts to raise awareness about hunger as a health issue. For more information about ProMedica, please visit <a href='/about-promedica/'>www.promedica.org/aboutus</a>.<br />"
  }
]