[
  {
    "id": 1,
    "title": "Paramount Dental Launches Tele-Dental Services For Members , Paramount Health Care",
    "url": "https://www.paramounthealthcare.com/news/paramount-dental-launches-tele-dental-services-for-members",
    "content": {
      "banner": "https://www.paramounthealthcare.com/assets/images/blog-header-images/tele-dental_provider_780x330.jpg",
      "bannerAlt": "dental provider holding a tablet for a tele-dental visit",
      "body": "\n\t\t\t\t\t\t<p></p><h1>Paramount Dental Launches Tele-Dental Services For Members</h1>\n<p><strong>TOLEDO, Ohio, January 16, 2023</strong> – Paramount Dental is pleased to announce the launch of tele-dental services for members. The new service will allow members to access a dentist online from the comfort of their own homes at no additional cost. In partnership with The TeleDentists, Paramount Dental now enables patients to utilize virtual tools to access on-demand dentists and other resources.</p>\n<p>A network of dentists are on-call and available for virtual dental visits 24/7/365 via mobile app, phone or web. Through a video consultation, the licensed dentists in the network can diagnose oral or dental problems, creating a personalized treatment plan. Upon diagnosis, the dentist can start the patient on remediation, which may include medication. When follow-up care is needed, appointments are booked with an appropriate dentist located near the member.</p>\n<p>The TeleDentists is a national virtual care dental provider with more than 300 dentists in its network. All consulting dentists are board licensed and carefully screened.</p>\n<p>\"As the need for telemedicine continues to grow, this offering ensures Paramount Dental members have convenient access to an in-network provider close to home or virtually,\" said Josh Nace, president of Paramount Dental. \"With the ability to provide a dental visit virtually, we hope that members will utilize dental benefits and can seek care in a timely manner, improving dental health and overall health.\"</p>\n<p>\"We are thrilled to help Paramount Dental expand its services to members in Ohio, Michigan, Indiana and Kentucky,\" says Dr. Maria Kunstadter, co-founder and CEO of The TeleDentists. \"Increasing access to oral health services is imperative to saving healthcare costs for members.\"</p>\n<hr>\n<p><em>Media contact: Mary Modene<br> Office: <a href=\"tel:15675850326\">567-585-0326</a><br> Email: <a href=\"mailto:callie.dudek@promedica.org\">callie.dudek@promedica.org</a><br> Cell: <a href=\"tel:14192620371\">419-262-0371</a><br> Website: <a href=\"https://www.insuringsmiles.com\">insuringsmiles.com</a></em></p><p></p>\n\t\t\t\t\t"
    }
  },
  {
    "id": 2,
    "title": "Marketplace Five Star Rating, Paramount Health Care",
    "url": "https://www.paramounthealthcare.com/news/marketplace-five-star-rating",
    "content": {
      "banner": "https://www.paramounthealthcare.com/assets/images/banners/marketplace_star_rating_couple_780x330.jpg",
      "bannerAlt": "",
      "body": "\n\t\t\t\t\t\t<p></p><p>Paramount's Health Insurance Marketplace<sup>©</sup> plans received 5 out of 5 stars for quality from the Centers for Medicare &amp; Medicaid Services (CMS) for the 2023 plan year.</p>\n<p>\"This year’s 5-star rating is evidence that Paramount is providing the best experience for its members and offers high quality plans for those shopping on the Health Insurance Marketplace,” said Dee Ann Bialecki-Haase, MD, MBA, CPE, chief medical officer, Paramount Healthcare.</p>\n<p>The CMS rating is based on medical care, member experience, and plan administration. One star is the lowest rating; five stars is the highest rating. The overall rating and additional rating categories are publicly displayed on HealthCare.gov to assist with consumer plan comparison</p>\n<p>Learn more about our quality <a url=\"https://www.paramounthealthcare.com/individuals-families/\">Paramount Marketplace plans</a>. Marketplace open enrollment period runs Nov. 1 – Jan.15.</p><p></p>\n\t\t\t\t\t"
    }
  },
  {
    "id": 3,
    "title": "Paramount Elite's (HMO) Medicare Plans Receive High Star Rating from CMS, Paramount Health Care",
    "url": "https://www.paramounthealthcare.com/news/paramount-elites-hmo-medicare-plans-receive-high-star-rating-from-cms",
    "content": {
      "banner": "https://www.paramounthealthcare.com/assets/images/blog-header-images/star-rating-couple-tablet.jpg",
      "bannerAlt": "a senior couple looks at a digital tablet together in their living room",
      "body": "\n\t\t\t\t\t\t<p></p><p>We are thrilled to share that for 2023 Paramount’s Medicare Advantage plans, called Paramount Elite (HMO), received 4.5 out 5 stars from the Centers for Medicare and Medicaid Services (CMS). CMS publishes Star Ratings for Medicare Advantage (Medicare Part C) and Medicare Part D plans each year.</p>\n<p>“Achieving 4.5 out of 5 stars for 2023 is especially rewarding in this challenging post-pandemic environment. While our star rating increased from 4 to 4.5 out of 5 stars, the average star rating for Medicare Advantage plans decreased from 4.37 stars to 4.15 out of 5 stars,” explained Holly Zorz, team lead for Medicare quality improvement, Paramount.</p>\n<h2>What are Medicare Star Ratings?</h2>\n<p>The rating system helps Medicare consumers compare the quality of health plans and rounds out benefit and cost information to support shopping decisions.</p>\n<p>Every health plan is rated against the same criteria to give consumers a fair quality and performance comparison of the plans in their area. Medicare evaluates a plan’s staying healthy programs, care coordination, access to care and medication, managing chronic conditions, member experience and satisfaction, pharmacy services, and customer service.</p>\n<p>CMS uses a five-star quality rating system to evaluate the quality and performance of Medicare Advantage health plans. One star is the lowest rating; five stars is the highest.</p>\n<p>To learn more about a Medicare Advantage plan from Paramount Elite, call us at <a href=\"tel:8888910707\">888-891-0707</a> (TTY <a href=\"tel:18888910707\">888-740-5670</a>). Or, come to one of our Medicare workshops and talk face-to-face with an expert. To find a workshop near you, visit <a href=\"/medicare/2023/new-to-medicare/medicare-workshops\" target=\"_blank\">paramounthealthcare.com/workshops</a>.</p>\n<p>Paramount Elite is an HMO plan with a Medicare contract. Enrollment in Paramount Elite depends on contract renewal.</p>\n<hr>\n<p>Y0140_2023StarWebStoryV2_M Accepted<br> Last updated: 10/30/2022</p><p></p>\n\t\t\t\t\t"
    }
  },
  {
    "id": 4,
    "title": "Paramount Elite Medicare adds McLaren St. Luke's and Mercy Health to provider network, Paramount Health Care",
    "url": "https://www.paramounthealthcare.com/news/paramount-elite-medicare-adds-mclaren-st-lukes-and-mercy-health-to-provider-network",
    "content": {
      "banner": "https://www.paramounthealthcare.com/assets/images/blog-header-images/provider-network-nurse-and-patient-hospital-paperwork-header.jpg",
      "bannerAlt": "patient and healthcare provider discuss treatment next to a hospital room",
      "body": "\n\t\t\t\t\t\t<p></p><p>To ensure that Paramount Elite (HMO/PPO) Medicare Advantage members have easy access to their favorite hospitals and providers in northwest Ohio and southeast Michigan, Paramount recently added two more local health systems to the provider network:</p>\n<ul>\n<li>McLaren St. Luke’s hospital and WellCare Physicians Group.</li>\n<li>Mercy Health hospitals and medical group providers.</li>\n</ul>\n<p>Also, in the Paramount Elite network includes:</p>\n<ul>\n<li>ProMedica hospitals and ProMedica Physicians Group providers.</li>\n<li>The Toledo Clinic.</li>\n<li>The University of Toledo Medical Center and medical group providers.</li>\n<li>Wood County Hospital.</li>\n</ul>\n<p>For a complete directory of our Paramount Elite Medicare Advantage provider network, use our <a href=\"https://www.myparamount.org/provider-search/\" title=\"provider search\">online search tool</a>.</p>\n<hr>\n<p>Y0140_2023NetworkWebStory_M Accepted<br> Last updated: 10/25/2022</p><p></p>\n\t\t\t\t\t"
    }
  },
  {
    "id": 5,
    "title": "It's Open Enrollment for Medicare until December 7, Paramount Health Care",
    "url": "https://www.paramounthealthcare.com/news/its-open-enrollment-for-medicare-until-december-7",
    "content": {
      "banner": "https://www.paramounthealthcare.com/assets/images/blog-header-images/medicare-open-enrollment-women-beach.jpg",
      "bannerAlt": "two senior women take a selfie on the beach",
      "body": "\n\t\t\t\t\t\t<p></p><p><strong>Are you wondering what to look for in a Medicare plan this year? </strong></p>\n<p>It’s that time of year again – Medicare Annual Enrollment Period (AEP) from Oct. 15 – Dec. 7. It’s important to review your plan every year to make sure that it still meets your health and well-being needs.</p>\n<p>Whether you are new to Medicare or an experienced shopper, this article will help you decide what is most important to you. Then it provides a few easy-to-follow next steps.</p>\n<p>Questions to ask yourself:</p>\n<ul type=\"disc\">\n<li>Are you happy with your doctors?</li>\n<li>Are you happy with the amount you’re paying in premiums?</li>\n<li>How about the amount you’re paying in copays?</li>\n<li>Are you comfortable with your prescription coverage?</li>\n<li>Do you like the facilities, hospitals and pharmacies that are covered under your plan?</li>\n<li>Do you feel your deductible is a good fit for your budget?</li>\n<li>Do you think the coverage outside your area suits your travel needs?</li>\n<li>Does your plan have enhanced benefits you value, like the SilverSneakers<sup>®</sup> Fitness program?</li>\n</ul>\n<p>If you answered no to more than one or two of these, it’s definitely worth looking into a new plan. It doesn’t mean you have to change, but you may find one you like better. Or you may realize the one you have isn’t so bad.</p>\n<p>If you do want to change, there is always the Annual Enrollment Period which runs from Oct. 15 to Dec 7 every year. Of course, there may also be Special Election Periods throughout the year.</p>\n<p>Ready to start investigating different Medicare plans?</p>\n<p>See if a Paramount Elite Medicare plan is right for you. Give us a call at <a href=\"tel:18888910707\">888-891-0707</a> (TTY <a href=\"tel:18887405670\">888-740-5670</a>). Or, come to one of our Medicare workshops and talk face-to-face with an expert. To find a workshop near you, visit <a href=\"https://www.paramounthealthcare.com/medicare/2023/new-to-medicare/medicare-workshops\" target=\"_blank\">paramounthealthcare.com/workshops</a>.</p>\n<p>Paramount Elite is an HMO plan with a Medicare contract. Enrollment in Paramount Elite depends on contract renewal.</p>\n<hr>\n<p>Y0140_2023MAWebStory1_M Accepted</p>\n<p>Last updated: 10/25/2022</p><p></p>\n\t\t\t\t\t"
    }
  },
  {
    "id": 6,
    "title": "Paramount Has Moved, Paramount Health Care",
    "url": "https://www.paramounthealthcare.com/news/paramount-has-moved",
    "content": {
      "banner": "https://www.paramounthealthcare.com/assets/images/blog-header-images/paramount_is_moving_780x330.jpg",
      "bannerAlt": "",
      "body": "\n\t\t\t\t\t\t<p></p><h2>Paramount has moved!</h2>\n<p>Paramount Insurance has moved to 300 Madison Ave., Suite 270, Toledo, Ohio 43604. You can now find us in The Plaza in Downtown Toledo. We will no longer be operating in the 1901 Indian Wood Circle location in Maumee, Ohio as of <strong>June 10, 2022</strong>. As of <strong>June 13, 2022</strong> please visit us at our new location in Downtown Toledo or at the Paramount Member Services Center in Maumee. If you visit us at The Plaza, check-in with security in the main lobby. Security will direct you to the Paramount reception desk on Floor 2.</p>\n<p><a class=\"btn btn-primary\" href=\"/about-us/maps-and-directions\" title=\"Paramount Is Moving\">View Map and Directions</a></p>\n<h3>Paramount Member Services Center</h3>\n<p>Our Paramount Member Services Center is located at 650 Beaver Creek Circle, Suite 100, Maumee, Ohio 43537. Beginning on June 13, the Paramount Member Service Center will be open:</p>\n<p>Monday – Friday, 8 a.m. – 5 p.m.</p>\n<p>The Cashiers Office hours are Monday, Wednesday, Friday, 10 a.m. – 2 p.m.</p>\n<p><a class=\"btn btn-primary\" href=\"/assets/documents/members/paramount_is_moving_flyer.pdf\" target=\"_blank\" title=\"Paramount Is Moving\">Download Our Flyer <i class=\"fas fa-download\" aria-hidden=\"true\"></i></a></p><p></p>\n\t\t\t\t\t"
    }
  },
  {
    "id": 7,
    "title": "New for Paramount Employer-Sponsored and Marketplace Health Plans, Paramount Health Care",
    "url": "https://www.paramounthealthcare.com/news/reimbursement-for-over-the-counter-covid-19-at-home-test-kits",
    "content": {
      "banner": null,
      "bannerAlt": null,
      "body": "\n\t\t\t\t\t\t<p></p><h1>Reimbursement for over-the-counter COVID-19 at-home test kits</h1>\n<p>Earlier this week, the <a href=\"https://www.hhs.gov/about/news/2022/01/10/biden-harris-administration-requires-insurance-companies-group-health-plans-to-cover-cost-at-home-covid-19-tests-increasing-access-free-tests.html\" target=\"_blank\">Biden-Harris Administration announced new federal guidelines</a> that require private health insurance plans to cover the costs for over-the-counter COVID-19 diagnostic tests purchased on or after Jan. 15, 2022.</p>\n<p>The new coverage requirement means that members of Paramount employer-sponsored or Marketplace health plans can go online or to a pharmacy or store, buy a test, and either get it paid for up front by Paramount or get reimbursed for the cost by submitting a claim to Paramount.</p>\n<ul>\n<li>Based on the guidelines provided by the Biden administration, Paramount will cover up to eight over-the-counter at-home COVID-19 tests per 30-day period for each person covered under your plan.</li>\n<li>Tests must be approved, cleared or authorized by the U.S. Food and Drug Administration.</li>\n<li>You can only get reimbursed for tests purchased on Jan. 15, 2022 or later.</li>\n<li>These tests don’t require an order from your physician to qualify for reimbursement.</li>\n<li>Tests must be used to diagnose a potential COVID-19 infection. Tests used for employment, school or recreational purposes are not eligible for reimbursement.</li>\n</ul>\n<p><strong>Note:</strong> This new coverage reimbursement policy doesn't apply to members who have Paramount Medicare, Medicare Supplement or Medicaid health plans.</p>\n<hr>\n<p><a href=\"/covid-19/at-home-covid-testing-kits\" title=\"At-Home COVID Test kits\">Learn more about COVID at-home test kit reimbursement</a>.<br><a href=\"/covid-19/\" title=\"COVID Information\">View COVID resources for Paramount members.</a></p><p></p>\n\t\t\t\t\t"
    }
  },
  {
    "id": 8,
    "title": "Vaccinated Children on Medicaid Approved to Receive $100 Gift Card, Paramount Health Care",
    "url": "https://www.paramounthealthcare.com/news/vaccinated-children-on-medicaid-approved-to-receive-100-gift-card",
    "content": {
      "banner": "https://www.paramounthealthcare.com/assets/images/blog-header-images/5-11_vaccine.jpg",
      "bannerAlt": "girl receives vaccine from a health care worker",
      "body": "\n\t\t\t\t\t\t<p></p><h1>Vaccinated Children on Medicaid Approved to Receive $100 Gift Card</h1>\n<h2>CDC Approval Makes Protection Available to Ages 5 to 11</h2>\n<p>From the Ohio Association of Health Plans<br> <em>Policy, Partnership, Advocacy</em><br> Nov. 12, 2021</p>\n<p>COLUMBUS, Ohio — For Ohio Medicaid members, heading into the holidays can feel safer and more secure as younger children, from age 5 to 11, can now get vital vaccine protection from COVID-19. Their families also can have extra income for the holidays: younger children in <a href=\"https://medicaid.oahp.org/\" target=\"_blank\" title=\"Ohio Medicaid Managed Care plans\">Ohio Medicaid Managed Care</a> plans are eligible for a $100 gift card when they receive the first shot, just as their older family members have been.&nbsp;&nbsp;</p>\n<p>This comes as the Centers for Disease Control and Prevention (CDC) gives the green light for 28 million kids in the 5 to 11 age group to get the vaccine. According to the Ohio Department of Health, 206,000 COVID-19 cases have occurred in Ohio children 17 and younger and 2,000 of those have required hospitalization.&nbsp;</p>\n<p>The timing of this vaccine for preadolescent children is critical as Ohio heads into the winter months and indoor gatherings rise — two factors that have historically increased the number of COVID-19 cases,” said Kelly O’Reilly, president and CEO of the <a href=\"https://oahp.org/\" target=\"_blank\" title=\"Ohio Association of Health Plans\">Ohio Association of Health Plans</a>. “According to the medical directors of our health plans, greatly increasing the number of vaccinated people is the key to ending the pandemic.</p>\n<p><dpiv>Working together, Ohio’s Medicaid Managed Care plans — Aetna, Buckeye Health Plan, CareSource, Molina Healthcare, <a href=\"/medicaid/\" title=\"Paramount Advantage\">Paramount Advantage</a> and UnitedHealthcare — made finding and getting the vaccine easier than ever with <a href=\"https://www.covidvaxonthespot.com/\" target=\"_blank\" title=\"Vax on the Spot\">Vax on the Spot</a>, a website with information on community vaccine events, transportation solutions and walk-in opportunities at pharmacies.&nbsp;&nbsp;</dpiv></p>\n<p>Understanding that parents and caregivers have concerns about the safety of the vaccines and possible side effects and long-term effects, the health plans have included on the Vax on the Spot site a <a href=\"https://www.covidvaxonthespot.com/get-the-facts/\" target=\"_blank\" title=\"Q&amp;A page \">Q&amp;A page </a>outlining key facts: The vaccines are safe for children and for pregnant women, and the risks of contracting COVID-19 are greater than any risk associated with receiving the vaccine.&nbsp;</p>\n<h3>Provider Reimbursement&nbsp;</h3>\n<p>As part of this initiative, the health plans also have expanded a $100 vaccination reimbursement payment for providers and pharmacists. Rather than solely on the first dose, the reimbursement payments now apply when each dose, including boosters, is given of the Pfizer-BioNTech, Johnson &amp; Johnson’s Janssen and Moderna COVID-19 vaccinations.&nbsp;</p>\n<p>The expanded payments for providers are another tool for overcoming hesitancy, as they make it feasible for pharmacists and other providers to take the time to counsel patients and caregivers about their concerns.&nbsp;</p>\n<h3>Campaign is Working&nbsp;</h3>\n<p>In a new <a href=\"https://www.youtube.com/watch?v=l9n5R-69h6E\" target=\"_blank\" title=\"video \">video </a>highlighting the Vax on the Spot campaign, health plans, providers and community partners explain how they worked collaboratively to educate and vaccinate vulnerable Ohioans. Medicaid members also share personal accounts of why they finally decided to get the vaccine.&nbsp;&nbsp;</p>\n<p>To date more than 977,000 people in the Medicaid program have received at least one dose, with 877,000 fully vaccinated.&nbsp;&nbsp;</p>\n<p>Medicaid vaccine gift cards will continue to be available to eligible Ohioans through Dec. 31, 2021.&nbsp;</p>\n<p>For more on Ohio’s Medicaid Managed Care Organizations, visit <a href=\"https://medicaid.oahp.org/\" target=\"_blank\">https://medicaid.oahp.org/.</a>&nbsp;</p>\n<hr>\n<p><em>Media Contact: Celina Fabrizio<br> <a href=\"mailto:cfabrizio@werthpr.com\">cfabrizio@werthpr.com</a><br><a href=\"/assets/documents/covid/5to11vaxrelease.pdf\" target=\"_blank\" title=\"5 to 11 Vaccine Press Release\">Download the press release <i class=\"fas fa-download\" aria-hidden=\"true\"></i></a></em></p>\n<p></p><p></p>\n\t\t\t\t\t"
    }
  },
  {
    "id": 9,
    "title": "See a doctor from the comfort of your home, Paramount Health Care",
    "url": "https://www.paramounthealthcare.com/news/see-a-doctor-from-the-comfort-of-your-home",
    "content": {
      "banner": "https://www.paramounthealthcare.com/assets/images/blog-header-images/telehealth-appointments-banner.jpg",
      "bannerAlt": " ",
      "body": "\n\t\t\t\t\t\t<p></p><p><strong>Did you know you can have a telehealth doctor visit from the comfort of your home?</strong> You may be able to see your doctor without leaving your home or workplace. For a telehealth visit, you will use your telephone, smart phone, or tablet to have a call or video visit with your doctor.</p>\n<p>Telehealth is a safe and convenient alternative to traditional in-person visits for managing some health care needs. Receive care from the comfort of your home or work with no need to travel, rearrange your busy schedule, or manage childcare. By using telehealth services, you will no longer need to sit in the waiting area or risk exposure during cold and flu season.</p>\n<p>Telehealth can be used in combination with routine visits to your doctor to monitor health conditions, like diabetes or high blood pressure. In addition, some common symptoms that may be treated during a telehealth visit are cough, fever, headache, runny nose, sore throat, and other cold or flu symptoms. Telehealth visits are covered by your health plan. Please contact your doctor’s office to check if they offer telehealth appointments.</p>\n<p><a href=\"/assets/documents/ondemand/telehealth-appointment.pdf\" target=\"_blank\">Learn more about telehealth visits <i class=\"fas fa-download\" aria-hidden=\"true\"></i></a></p><p></p>\n\t\t\t\t\t"
    }
  },
  {
    "id": 10,
    "title": "7 strategies for cutting back or quitting drinking, Paramount Health Care",
    "url": "https://www.paramounthealthcare.com/news/7-strategies-for-cutting-back-or-quitting-drinking",
    "content": {
      "banner": null,
      "bannerAlt": null,
      "body": "\n\t\t\t\t\t\t<p></p><h1>7 strategies for cutting back or quitting drinking</h1>\n<p>This April, during Alcohol Awareness Month, Paramount encourages you to learn about the dangers of drinking too much.</p>\n<blockquote>\n<p class=\"mb-0\">“Drinking too much alcohol increases people’s risk of injuries, violence, drowning, liver disease, and some types of cancer.”</p>\n<span style=\"font-size: 14px;\">—Dee Ann Bialecki-Haase, MD,&nbsp;<cite title=\"Source Title\">family medicine doctor and chief medical officer for Paramount.</cite></span></blockquote>\n<p>If you are drinking too much, you can improve your health by cutting back or quitting. Dr. Bialecki-Haase offers these strategies to help:</p>\n<ol>\n<li>Limit your drinking to no more than 1 drink a day for women or 2 drinks a day for men.</li>\n<li>Keep track of how much you drink.</li>\n<li>Choose a day each week when you will not drink.</li>\n<li>Don’t drink when you are upset.</li>\n<li>Limit the amount of alcohol you keep at home.</li>\n<li>Avoid places where people drink a lot.</li>\n<li>Make a list of reasons not to drink.</li>\n</ol>\n<p>If you are concerned about someone else’s drinking, offer to help. If you are concerned about your own drinking, talk with your primary care provider about available resources.</p><p></p>\n\t\t\t\t\t"
    }
  }
]