[
  {
    "id": 1,
    "title": "Six ways Paramount Elite can help keep you healthy.",
    "url": "https://www.paramounthealthcare.com/medicare/2023/educational-articles/six-ways-paramount-elite-can-help-keep-you-healthy",
    "metaTags": [
      "<meta charset=\"utf-8\">",
      "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1, shrink-to-fit=no\">",
      "<meta http-equiv=\"X-UA-Compatible\" content=\"IE=edge,chrome=1\">",
      "<meta name=\"pagetype\" content=\"ContentPage\">",
      "<meta property=\"og:title\" content=\"Six ways Paramount Elite can help keep you healthy.\">",
      "<meta property=\"og:url\" content=\"https://www.paramounthealthcare.com/medicare/2023/educational-articles/six-ways-paramount-elite-can-help-keep-you-healthy\">",
      "<meta property=\"og:locale\" content=\"en_US\">",
      "<meta name=\"robots\" content=\"index, follow\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">"
    ],
    "content": {
      "banner": "https://www.paramounthealthcare.com/assets/images/blog-header-images/6ways_780x330.jpg",
      "bannerAlt": null,
      "body": "<br />6 Ways Paramount Elite Can Help Keep You Healthy<br />By Dee Ann Bialecki-Haase, MD, Chief Medical Officer, Paramount<br />I chose family medicine because I love taking care of families – from grandparents to grandchildren to great grandchildren. It’s what I’ve been doing for more than 20 years as a family medicine doctor at ProMedica Physicians Family Medicine. And now, I’m also the chief medical officer for Paramount Health Care. This means the family I care for has grown. So, I have an even bigger appreciation for the importance of the patient, physician and health plan working together to create the best possible outcomes. I truly believe Paramount is an advocate for every single one of its patients. Its benefits are proof. Here are six of my favorites:<br />1. Medication Therapy Management Program<br />This program helps those who qualify get the greatest health benefits from their medications by preventing or reducing drug-related risks and supporting good habits. It includes a comprehensive medication review via a one-on-one phone call with a pharmacist. It also includes a targeted medication review, in which Paramount Elite (HMO/PPO) connects with me as the patient’s doctor to recommend drugs that may be safer or work better than what my patient is currently taking.<br />2. Wellness Incentive<br />When you complete your annual wellness visit and two preventive health services, you’ll receive a $50 on a benefits card. I especially love this perk for my Paramount Elite Medicare patients, because some patients underestimate the importance of preventive screenings like mammograms and colorectal screenings. Maybe they think it won’t happen to them, or they’re busy, but early detection is so valuable.<br />3. Ask a Nurse<br />Ask a Nurse is available to members from 6 a.m. – midnight, 7-days-a-week. Our nurse line is staffed with a team of experienced registered nurses (RNs). They can answer health-related questions such as, “Should I see my doctor or go to an urgent care or emergency room?” It’s a nice addition to being able to call your doctor’s office.<br />4. Vision Benefits<br />As part of Paramount Elite benefits, members have coverage for some vision services that Medicare alone doesn’t cover. Our plan also covers glasses or contact lenses every 24 months.<br />5. Dental Benefits<br />As we age, scheduling regular visits with our dentist is more important than ever. Medications and common chronic illnesses, such as diabetes and heart disease, put seniors at an increased risk for dental problems. All Paramount Elite Medicare plans include preventive and comprehensive services at no cost to the member.<br />Depending on your Paramount Elite Medicare plan, members have the option to purchase additional coverage for a low monthly premium for extras like coverage for crowns and fillings. You can search for all Paramount dental providers by using our online provider search tool <a href='https://www.insuringsmiles.com/FindADentist' target='_blank'>here</a>.<br /><a target='_blank' href='https://www.insuringsmiles.com/FindADentist'>Find a Dentist </a><br />6. SilverSneakers®<br />SilverSneakers is a fitness program that gives you a free basic gym membership to more than 15,000 fitness locations across the country. My patients enjoy amenities such as exercise equipment, pools and saunas, as well as fitness classes and other activities. There are six signature classes, available in select location, are geared toward varying fitness levels and interests. SilverSneakers FLEX® classes offer additional options, and for more challenging classes, try SilverSneakers BOOM™ Staying active as you age and working out with friends are good for the mind and body.<br />If you’re looking for a Medicare plan that will go to great lengths to help keep you healthy, Paramount Elite may be right for you. If you’re already a member, I encourage you to take advantage of all it has to offer.<br />Before selecting your Medicare plan, be sure to check out our complete <a href='/medicare/2023/new-to-medicare/medicare-checklist'>checklist</a>, which can help you pick the right plan.<br /><a href='/medicare/2023/new-to-medicare/medicare-checklist'>Use our easy checklist</a><br />Still have questions?<br />Give us a call. We're always happy to chat: <a href='tel:+14195975725 '>419-597-5725 </a> | TTY <a href='tel:+18887405670'>888-740-5670</a>.<br />You can also attend one of our <a href='/medicare/2023/new-to-medicare/medicare-workshops' target='_blank'>Medicare workshops</a> to talk to someone in person.<br />Paramount Elite is an HMO plan and a PPO plan each with a Medicare contract. Enrollment in Paramount Elite (HMO/PPO) depends on contract renewal.<br />Y0140_20236WaysArticle_M Accepted<br />Last updated: 10/26/2022<br />"
    }
  },
  {
    "id": 2,
    "title": "Get Ready for a Healthier Year with SilverSneakers",
    "url": "https://www.paramounthealthcare.com/medicare/2023/educational-articles/get-ready-for-a-healthier-year-with-silversneakers",
    "metaTags": [
      "<meta charset=\"utf-8\">",
      "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1, shrink-to-fit=no\">",
      "<meta http-equiv=\"X-UA-Compatible\" content=\"IE=edge,chrome=1\">",
      "<meta name=\"pagetype\" content=\"ContentPage\">",
      "<meta property=\"og:title\" content=\"Get Ready for a Healthier Year with SilverSneakers\">",
      "<meta property=\"og:url\" content=\"https://www.paramounthealthcare.com/medicare/2023/educational-articles/get-ready-for-a-healthier-year-with-silversneakers\">",
      "<meta property=\"og:locale\" content=\"en_US\">",
      "<meta name=\"robots\" content=\"index, follow\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">"
    ],
    "content": {
      "banner": "https://www.paramounthealthcare.com/assets/images/blog-header-images/healthier_year_with_silver_sneakers_blog.jpg",
      "bannerAlt": "senior male holds a chair pose in yoga class alongside other senior citizens",
      "body": "<br />Get ready for a healthier year with SilverSneakers<br />Your health is our top priority at Paramount Elite Medicare. That’s why we offer SilverSneakers® as your fitness benefit. With SilverSneakers, you can get active and stay healthy in the ways that work best for you. You can take live virtual classes at home, view workout videos, exercise with smaller groups in your area or go to the gym1. It’s all included at no additional cost to you.<br />SilverSneakers also gives you valuable health and wellness information, like the following tips on setting and reaching goals.<br />Here are three simple steps to start and keep going with a healthy activity habit.2<br />Change the way you set goals. Specifically, start with smaller goals. Does 150 minutes of activity a week sound like a lot? It’s only 30 minutes a day for 5 weekdays – or however you choose to split it up.<br />Find an activity you truly enjoy. You’re far more likely to stick with exercising if you’re doing something you like.<br />Hold yourself accountable or find someone else who will. Work out with a friend. It’s more fun, and you won’t want to let your workout buddy down. Attending SilverSneakers fitness classes is also a great option.<br />Be sure your goals are SMART: Specific, Measurable, Attainable, Relevant and Time-bound.3<br />Specific and Measurable. Know exactly what you will do and how you will check your success along the way. “Get in shape” is not specific enough. Instead, you might say, “Walk 20 to 30 minutes a day.” This is specific and easy to measure – you either did it or not.<br />Attainable. Be realistic and don’t set the goal too high. For example, rather than saying you’re giving up soda, say “I’ll drink a glass of water with each meal.” Then each time you do that, you’ll feel closer to your goal of giving up soda.<br />Relevant. Make sure it’s important to you. Why do you want to reach this goal? List the positive things that might happen once you reach the goal. Use those positive outcomes as your motivation.<br />Time-bound. Simply give yourself a deadline. And think in smaller, timely goals. If you want to run a 10k this year, start by saying you’ll run a mile in January. Then aim for two miles in February and continue adding monthly.<br />Get a jump on reaching your goals this year with SilverSneakers. Create your online account at <a href='https://tools.silversneakers.com/Eligibility/StartHere?utm_campaign=Monthly_Editorial_Content&amp;utm_source=client&amp;utm_medium=social&amp;utm_content=client_monthly_editorial_social_january_2022' target='_blank'>SilverSneakers.com/StartHere</a> to get your SilverSneakers ID number and unlock access to everything that’s included.<br />SilverSneakers LIVE™ virtual classes and workshops<br />SilverSneakers Community classes, both in-person and virtual, offered locally<br />SilverSneakers On-Demand™ videos available 24/7<br />The SilverSneakers GO™ mobile app<br />Access to thousands of participating locations with equipment, pools and other amenities1<br />Group exercise classes4 for all levels at select participating locations<br />Always talk with your doctor before starting an exercise program.<br />Participating locations (“PL”) are not owned or operated by Tivity Health, Inc. or its affiliates. Use of PL facilities and amenities is limited to terms and conditions of PL basic membership. Facilities and amenities vary by PL.<br /><a href='https://www.silversneakers.com/blog/qa-not-motivated-to-work-out-do-this/' target='_blank'>https://www.silversneakers.com/blog/qa-not-motivated-to-work-out-do-this/</a><br /><a href='https://www.silversneakers.com/blog/new-years-resolutions-make-smart-goals/' target='_blank'>https://www.silversneakers.com/blog/new-years-resolutions-make-smart-goals/</a><br />Membership includes SilverSneakers instructor-led group fitness classes. Some locations offer members additional classes. Classes vary by location.<br />SilverSneakers is a registered trademark of Tivity Health, Inc. SilverSneakers LIVE, SilverSneakers On-Demand and SilverSneakers GO are trademarks of Tivity Health, Inc. © 2022 Tivity Health, Inc. All rights reserved. SSFP2558_1121<br />Y0140_2022WebArticleSS_C<br />"
    }
  },
  {
    "id": 3,
    "title": "Tips for Holiday Travel with Hearing Loss",
    "url": "https://www.paramounthealthcare.com/medicare/2023/educational-articles/tips-for-holiday-travel-with-hearing-loss",
    "metaTags": [
      "<meta charset=\"utf-8\">",
      "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1, shrink-to-fit=no\">",
      "<meta http-equiv=\"X-UA-Compatible\" content=\"IE=edge,chrome=1\">",
      "<meta name=\"pagetype\" content=\"ContentPage\">",
      "<meta property=\"og:title\" content=\"Tips for Holiday Travel with Hearing Loss\">",
      "<meta property=\"og:url\" content=\"https://www.paramounthealthcare.com/medicare/2023/educational-articles/tips-for-holiday-travel-with-hearing-loss\">",
      "<meta property=\"og:locale\" content=\"en_US\">",
      "<meta name=\"robots\" content=\"index, follow\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">"
    ],
    "content": {
      "banner": "https://www.paramounthealthcare.com/assets/images/blog-header-images/tips-for-travel-hearing-aids.jpg",
      "bannerAlt": "senior woman smiles as she prepares to position her hearing aid",
      "body": "<br />Tips for Holiday Travel with Hearing Loss<br />With more people vaccinated every day, the world is learning how to travel again. You can only go so long without seeing family, friends, and loved ones, and for those discovering they have hearing loss, holiday travel has a different set of challenges. From road noise to communication issues—there’s a lot to navigate. <br />Follow these tips to make your holiday trips a little merrier.<br />General Travel<br />When travelling, do you often find yourself asking others to repeat themselves? The fewer questions you need to ask someone wearing a mask behind a plexiglass wall in a noisy lobby, the better.<br />Get in the habit of using smartphone apps to manage reservations, navigation, and travel alerts. It also doesn’t hurt to keep some things old school. Bring back-up printed copies of important documents like hotel reservations and tickets.<br />Planes &amp; Trains<br />Have you noticed you’re missing out on important travel announcements? Let the conductor or flight attendant know you’re having difficulty hearing so they can make sure you’re informed of last-second changes. Know your schedules, sign up for text alerts through your airline or train’s app, and watch the live timetable screens for last-minute changes. Sit near the gate or departure lobby so you don’t miss boarding.<br />Automobiles<br />One of the worst parts of car rides for people with hearing loss is background noise. It’s even worse when roads are wet and slushy. If you’re taking a ride share, carry a notepad and pen to answer questions—or communicate with your driver by text using your phone’s rideshare app. It’s a good idea to politely notify your driver that you have hearing loss, so they don’t try to start up a conversation or think you’re being rude.<br />For Those Travelling with Hearing Aids<br />Always pack your hearing aid supplies—including extra batteries and charging cables—in a self-contained bag inside your carry-on, where it’s easy to access. You want to be prepared for unexpected delays or lost luggage. When walking through metal detectors and security checkpoints, you might feel the urge to remove your devices, but you don’t have to. Detection equipment is perfectly safe for the electronics in your hearing aids.<br />New tech could ease your travel woes.<br />If you’ve been thinking about getting your hearing checked, new advancements in hearing aid technology can make all the difference during holiday travel. <br />Advanced noise reduction cuts airplane engine roar, chatter, and road rumble <br />Some models offer directional microphone control and even Bluetooth® audio synching to get navigation instructions from your car or phone sent directly to your hearing aids<br />Downloadable apps let you quickly and discreetly change hearing aid programs on the go<br />Directional programming lets you focus on the person in front of you, a travel partner next to you, or fast-moving traffic coming from behind you<br />Models with mask mode let you boost volumes when you can’t read lips <br />Remember, as a Paramount Elite (HMO/PPO) member, you have access to hearing care through TruHearing®. With your benefit, you get up to two new hearing aids per year at a low copay of $999 or less per aid.<br />If you’re experiencing hearing difficulty this holiday season, we hope you’ll take advantage of the program. Call TruHearing at <a href='tel:1-800-334-1807'>800-334-1807</a> to schedule a hearing exam with a provider in your area.<br />Y0140_2021HearingAidNov_C<br />"
    }
  },
  {
    "id": 4,
    "title": "Make Health and Wellness Your Top Priority",
    "url": "https://www.paramounthealthcare.com/medicare/2023/educational-articles/make-health-and-wellness-your-top-priority",
    "metaTags": [
      "<meta charset=\"utf-8\">",
      "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1, shrink-to-fit=no\">",
      "<meta http-equiv=\"X-UA-Compatible\" content=\"IE=edge,chrome=1\">",
      "<meta name=\"pagetype\" content=\"ContentPage\">",
      "<meta property=\"og:title\" content=\"Make Health and Wellness Your Top Priority\">",
      "<meta property=\"og:url\" content=\"https://www.paramounthealthcare.com/medicare/2023/educational-articles/make-health-and-wellness-your-top-priority\">",
      "<meta property=\"og:locale\" content=\"en_US\">",
      "<meta name=\"robots\" content=\"index, follow\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">"
    ],
    "content": {
      "banner": "https://www.paramounthealthcare.com/assets/images/blog-header-images/may2021_medicare_silver_sneakers_blog.jpg",
      "bannerAlt": " ",
      "body": "<br />Make Health and Wellness your Top Priority<br />Celebrate Senior Health &amp; Fitness Month with 3 life-changing habits<br />Eating a nutrient-rich diet and staying active are two important lifestyle choices that can help you feel your best at any age. It’s never too late to replace old, unhealthy habits with new ones so you can feel better and do more of the things you love to do. May is National Senior Health and Fitness Month, making it the perfect time to commit to taking care of yourself – mind, body and spirit.<br />3 ways you can improve your quality of life, starting today:<br />Make healthy choices at every meal. A nutrient-rich diet can increase your energy, improve cognitive function, help manage weight, and reduce your risk for certain diseases.1,2 And remember to stay hydrated by drinking water throughout the day.<br />Get moving. The Centers for Disease Control and Prevention recommend that seniors get at least 150 minutes of moderate aerobic activity a week – about 30 minutes a day, five days a week. A brisk walk, exercise class or bike ride are great options. Even 10 minutes of exercise can deliver health benefits! 3<br />Stay connected. Engaging with other people is important to our physical and mental health.4 Sometimes social opportunities slow down as we age, but it’s important to find ways to connect with others in ways that are enjoyable to you.<br />Ready to get on board, but not sure where to start? Your SilverSneakers benefit from Paramount Elite (HMO/PPO) is a great first step. SilverSneakers® is the nation’s leading fitness and lifestyle program for seniors, and eligible Paramount Elite members get it at no additional cost. SilverSneakers members have access to classes4 and workshops on fitness, nutrition and stress management, recipes, health articles, social opportunities and more. You can participate in person or from the comfort of home. For many members, SilverSneakers is a life-changing decision. Last year, 86 percent of members said SilverSneakers improved their quality of life.6 Now it’s your turn!<br />Participate in SilverSneakers events online or in person<br />You can join live SilverSneakers fitness classes from home, or by taking your member ID number to a participating location near you.7 Either way, SilverSneakers offers something for members of all fitness levels and abilities. And it’s a great way to meet new people.<br />Join a live class from home by visiting <a href='https://www.silversneakers.com/Live' target='_blank'>SilverSneakers.com/Live</a> or choose from a library of fitness and nutrition videos at <a href='https://www.SilverSneakers.com/OnDemand' target='_blank'>SilverSneakers.com/OnDemand</a>. It’s the perfect way to celebrate a healthier new you.<br /><a href='https://silversneakers.com/StartHere'>Get Started Today </a><br />Always talk with your doctor before starting an exercise program.<br />Sources:<br />National Institutes of Health, <a href='https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4983622' target='_blank'>https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4983622</a>, Accessed 3/4/2021<br />U.S. National Library of Medicine, <a href='https://medlineplus.gov/nutritionforolderadults.html' target='_blank'>https://medlineplus.gov/nutritionforolderadults.html</a>, Accessed 3/4/2021<br />American Heart Association, <a href='https://www.heart.org/en/healthy-living/fitness/fitness-basics/aha-recs-for-physical-activity-in-adults' target='_blank'>https://www.heart.org/en/healthy-living/fitness/fitness-basics/aha-recs-for-physical-activity-in-adults</a>, Accessed 12/2/2020<br />Centers for Disease Control and Prevention, <a href='https://www.cdc.gov/features/social-engagement-aging/' target='_blank'>cdc.gov/features/social-engagement-aging/</a>, Accessed 12/2/2020<br />Membership includes SilverSneakers instructor-led group fitness classes. Some locations offer members additional classes. Classes vary by location.<br />2019 SilverSneakers Annual Participant Survey<br />Participating locations (“PL”) are not owned or operated by Tivity Health, Inc. or its affiliates. Use of PL facilities and amenities is limited to terms and conditions of PL basic membership. Facilities and amenities vary by PL.<br />SilverSneakers is a registered trademark of Tivity Health, Inc. SilverSneakers On-Demand is a trademark of Tivity Health, Inc. © 2021 Tivity Health, Inc. All rights reserved. SSFP1085_0321<br />Y0140_2021SSMayArticle_M Accepted<br />"
    }
  },
  {
    "id": 5,
    "title": "Stay Active for Healthy Blood Pressure",
    "url": "https://www.paramounthealthcare.com/medicare/2023/educational-articles/stay-active-for-healthy-blood-pressure",
    "metaTags": [
      "<meta charset=\"utf-8\">",
      "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1, shrink-to-fit=no\">",
      "<meta http-equiv=\"X-UA-Compatible\" content=\"IE=edge,chrome=1\">",
      "<meta name=\"pagetype\" content=\"ContentPage\">",
      "<meta property=\"og:title\" content=\"Stay Active for Healthy Blood Pressure\">",
      "<meta property=\"og:url\" content=\"https://www.paramounthealthcare.com/medicare/2023/educational-articles/stay-active-for-healthy-blood-pressure\">",
      "<meta property=\"og:locale\" content=\"en_US\">",
      "<meta name=\"robots\" content=\"index, follow\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">"
    ],
    "content": {
      "banner": "https://www.paramounthealthcare.com/assets/images/blog-header-images/silver_sneakers_blog_2021_banner.jpg",
      "bannerAlt": " ",
      "body": "<br />Stay Active for Healthy Blood Pressure<br />Use your SilverSneakers benefit to get the exercise you need.<br />Did you know properly managing your blood pressure may also help lower your risk for heart disease and stroke? 1,2 During April, High Blood Pressure Month, focus on how to keep your blood pressure in a healthy range for overall good health.<br />In addition to a healthy diet, getting enough physical activity plays a key role in managing your blood pressure. 3 That’s why Paramount Elite (HMO/PPO) includes SilverSneakers® as your fitness benefit at no additional cost.<br />Participating in SilverSneakers may help you get the recommended minimum of 2.5 hours of moderate-intensity activity weekly, plus muscle-strengthening activities two days a week.4 The program offers many ways for you to stay active and learn more about the health benefits of exercise and good nutrition.<br />3 Ways you can use SilverSneakers to help manage blood pressure<br />Work out from home (or wherever you are) with virtual fitness classes available seven days a week. Even on Saturday and Sunday, energize your days by starting with a great workout led by SilverSneakers trainers. See the schedule and register at <a href='https://www.SilverSneakers.com/Live' target='blank'>SilverSneakers.com/Live</a>.<br />Access hundreds of class and workout videos any time through SilverSneakers On-Demand™. Plus, you can participate in workshops on wellness topics like nutrition. Check it out at <a href='https://www.silverSneakers.com/OnDemand' target='blank'>SilverSneakers.com/OnDemand</a>.<br />Get valuable information from SilverSneakers blog articles like “8 Ways to Lower Your Blood Pressure Without Meds.” Log in at <a href='https://www.SilverSneakers.com/blog' target='blank'>SilverSneakers.com/blog</a> to explore and learn.<br />Learn more about SilverSneakers and get started (if you haven’t already). Visit <a href='https://www.SilverSneakers.com' target='blank'>SilverSneakers.com</a>.<br />Always talk with your doctor before starting an exercise program.<br />References<br />Wake Forest Baptist Medical Center. “Intensive blood pressure can reduce risk of harm to heart muscle.” ScienceDaily. <a href='https://sciencedaily.com/releases/2017/05/170523081928.htm' target='blank'>www.sciencedaily.com/releases/2017/05/170523081928.htm</a> (accessed October 25, 2018).<br />American Heart Association. “Lower systolic blood pressure reduces risk of stroke.” ScienceDaily. <a href='https://sciencedaily.com/releases/2015/02/150211153828.htm' target='_blank'>www.sciencedaily.com/releases/2015/02/150211153828.htm</a>(accessed October 25, 2018).<br /><a href='https://cdc.gov/bloodpressure/healthy_living.htm' target='_blank'>cdc.gov/bloodpressure/healthy_living.htm</a><br /><a href='https://cdc.gov/physicalactivity/basics/older_adults/index.htm' target='blank'>cdc.gov/physicalactivity/basics/older_adults/index.htm</a><br />SilverSneakers is a registered trademark of Tivity Health, Inc. SilverSneakers On-Demand is a trademark of Tivity Health, Inc. © 2021 Tivity Health, Inc. All rights reserved. SSFP1075_1220<br />Y0140_2021SSAprilStory_M Accepted<br />"
    }
  },
  {
    "id": 6,
    "title": "Holidays, Hearing Loss, and COVID-19",
    "url": "https://www.paramounthealthcare.com/medicare/2023/educational-articles/holidays-hearing-loss-and-covid-19",
    "metaTags": [
      "<meta charset=\"utf-8\">",
      "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1, shrink-to-fit=no\">",
      "<meta http-equiv=\"X-UA-Compatible\" content=\"IE=edge,chrome=1\">",
      "<meta name=\"pagetype\" content=\"ContentPage\">",
      "<meta property=\"og:title\" content=\"Holidays, Hearing Loss, and COVID-19\">",
      "<meta property=\"og:url\" content=\"https://www.paramounthealthcare.com/medicare/2023/educational-articles/holidays-hearing-loss-and-covid-19\">",
      "<meta property=\"og:locale\" content=\"en_US\">",
      "<meta name=\"robots\" content=\"index, follow\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">"
    ],
    "content": {
      "banner": "https://www.paramounthealthcare.com/assets/images/blog-header-images/holidays_hearing_loss_covid.jpg",
      "bannerAlt": " ",
      "body": "<br />Holidays, Hearing Loss, and COVID-19<br />The holidays are a time to gather, celebrate, and connect with the people we love, but it’s also a tough time for people who experience hearing loss—especially during COVID-19. Beyond typical holiday parties, the hard of hearing have to navigate socially distant group gatherings, unreliable video call quality and audio, and mask wearing, which inhibits lip reading.<br />Here are a few simple ways we can be more empathetic of those with hearing loss:<br />Speak naturally<br />When we know the person we’re talking to has hearing loss, it’s our instinct to “speak up” so that they can hear us better. But shouting only makes it more difficult for the person to understand us. Instead, speak clearly and naturally. Minimize background noise, keep hands away from your face, and make eye contact while talking so they can read your body language. And above all, be patient. If you can see that they’re struggling to understand you, try expressing your thoughts in a different way. They want to understand you as much as you want to understand them.<br />Face masks<br />Many of us are covering our mouths with masks per the CDC recommendations to limit the spread of COVID-19. But face coverings make it harder for people with hearing loss who use lip reading to help them communicate with those around them. What can we do to help those with hearing loss—loved ones or strangers—feel included?<br />It’s important to understand that we all read lips, whether we’re hearing impaired or not. It’s part of reading others’ body language. And masks can muffle sound and make it hard for people even without hearing loss to hear each other.<br />The simplest solution is wearing a clear mask that allows others to see our lips while still providing the necessary coverage.<br />Video calls<br />During the last year, video technology has become a major form of communication in the workplace, between family and friends, and in healthcare. And during this holiday season, video calls may be the only way we can celebrate with loved ones. Here are a few key tips to make video accessible for those with hearing loss:<br />When beginning the call, check with the other person to make sure they can hear and see you clearly. Sit near enough so they can see your face and keep your hands away from your lips so they can read them as you’re talking. Make eye contact and speak towards the microphone so they can consistently hear you.<br />Because video calls are remote by default, masks aren’t needed. This makes lip reading much easier for the person with hearing loss.<br />Spending time with family is an important part of every holiday season and this year will feel very different because of COVID-19. Make sure you and your family are taking care of your hearing health so you can have the best interactions possible.<br />Y0140_2021TruHearingDec_M Accepted<br />"
    }
  },
  {
    "id": 7,
    "title": "Medicare Part D | Prescription Drug Coverage Gap",
    "url": "https://www.paramounthealthcare.com/medicare/2023/educational-articles/understanding-the-prescription-coverage-gap-aka-the-medicare-donut-hole",
    "metaTags": [
      "<meta charset=\"utf-8\">",
      "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1, shrink-to-fit=no\">",
      "<meta http-equiv=\"X-UA-Compatible\" content=\"IE=edge,chrome=1\">",
      "<meta name=\"description\" content=\"Understand the Medicare Part D donut hole. Learn more about Medicare Part D prescription drug coverage.\">",
      "<meta name=\"pagetype\" content=\"ContentPage\">",
      "<meta property=\"og:title\" content=\"Medicare Part D | Prescription Drug Coverage Gap\">",
      "<meta property=\"og:type\" content=\"website\">",
      "<meta property=\"og:description\" content=\"Understand the Medicare Part D donut hole. Learn more about Medicare Part D prescription drug coverage.\">",
      "<meta itemprop=\"description\" content=\"Understand the Medicare Part D donut hole. Learn more about Medicare Part D prescription drug coverage.\">",
      "<meta property=\"og:url\" content=\"https://www.paramounthealthcare.com/medicare/2023/educational-articles/understanding-the-prescription-coverage-gap-aka-the-medicare-donut-hole\">",
      "<meta property=\"og:locale\" content=\"en_US\">",
      "<meta name=\"robots\" content=\"index, follow\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">"
    ],
    "content": {
      "banner": null,
      "bannerAlt": null,
      "body": "<br />Understanding the Prescription Coverage Gap, AKA the Medicare Donut Hole<br />We know what you might be thinking – did they just say “donut hole”? We know it’s an odd term to use to explain Medicare coverage. But it’s commonly used to describe the coverage gap that’s part of all Medicare Part D plans. It occurs when the health plan (Paramount) and member (you) have spent a certain amount of money on prescription drugs.<br />We asked Paramount Elite Medicare pharmacist Craig Bogner, PharmD, BCPS, frequently asked questions to help you better understand the Medicare Part D donut hole.<br /><a href='#collapseOne'>WHAT IS THE DONUT HOLE? </a><br />Medicare commonly refers to the donut hole by another name – coverage gap. When you read through your Evidence of Coverage (EOC) or monthly Medicare Part D Explanation of Benefits (EOB) report, this is the term commonly used. Coverage gap is the drug payment stage that begins when the total amount of your year-to-date total drug costs reaches $4,020.<br />While most people do not reach this stage, for those who do, you will notice that your share of your drug’s costs often changes. A great way to keep track of how close you are to the coverage gap is to read the Explanation of Benefits (EOB) that we send monthly. It’s also called Your Monthly Prescription Drug Summary.<br /><a href='#collapseTwo'>HOW DOES THE DONUT HOLE WORK? </a><br />The standard Medicare Part D plan includes four drug payment stages. This is very important because how much you pay for a covered Medicare Part D prescription depends on which payment stage you are in when you fill it. Whether you move from one payment stage to the next depends on how much is spent on your drugs. The four drug payment stages are:<br />Yearly deductible (when your coverage begins)<br />Initial coverage<br />Coverage gap or donut hole<br />Catastrophic coverage<br />Paramount designs benefits with the goal to improve your health and well-being while trying to control the costs our Medicare members incur. For example, none of our individual Medicare Part D plans have a deductible. You begin in the initial coverage stage when you fill your first prescription of the year.<br />Most Medicare Part D plans have a coverage gap and some plans offer additional coverage for the coverage gap stage.<br /><a href='#collapseThree'>HOW MUCH DO I PAY DURING THE COVERAGE GAP? </a><br />When you fill prescriptions, we keep track of your total drug costs. Total drug costs is the total of all payments made for your covered Medicare Part D drugs. It includes what your plan pays, what you pay, and what others (programs or organizations) pay for your drugs. When this amount reaches $4,020, you enter the coverage gap stage or the donut hole. Again, reading your monthly EOB is a great way to keep track of how close you are to the coverage gap.<br />Once in the donut hole, members pay no more than 25% of the negotiated price and a portion of the dispensing fee for brand name drugs. For generic drugs, you pay 25% of the price with the exception of Tier 1 – Preferred Generics. These medications will continue as $0 during the coverage gap.<br />This is a great benefit because Tier 1 – Preferred Generics are commonly prescribed medications used to treat many of the health conditions affecting our members like diabetes, high blood pressure and high blood cholesterol.<br /><a href='#collapseFour'>CAN YOU GIVE AN EXAMPLE OF HOW THE DONUT HOLE WORKS? </a><br />On the Medicare.gov website, there is a good summary of how the coverage gap works, including two helpful examples of how to calculate how much you pay – one for brand drugs and one for generics.<br /><a href='#collapseFive'>DOES EVERYONE ENTER THE DONUT HOLE? </a><br />No. While many people enter the coverage gap stage, most do not. It’s very important to monitor the monthly EOB we send you. This will help you understand when you might enter into the coverage gap and what you will pay once you’re in the donut hole.<br /><a href='#collapseSix'>WHEN DO YOU GET OUT OF THE DONUT HOLE? </a><br />You generally stay in this stage until the amount of your year-to-date out-of-pocket costs reaches $6,350. Keep track of how close you are to leaving the coverage gap stage by reviewing the EOB that we send you monthly.<br /><a href='#collapseSeven'>WHAT SHOULD I KNOW ABOUT PARAMOUNT’S MEDICARE PLAN WHEN IT COMES TO THE DONUT HOLE? </a><br />If you reach the coverage gap, Tier 1 – Preferred Generics will continue to generate a $0 copay. For our members, this is a great value. Tier 1 – Preferred Generics are commonly prescribed medications. These treat many health conditions like diabetes, high blood pressure and high blood cholesterol.<br /><a href='/medicare/_assets/documents/1.2669-par-elite_donut-hole-infographic_p1-(2).pdf' target='_blank'>View our Medicare donut hole infographic </a><br />Ready to see if a Paramount Elite Medicare plan fits your prescription drug needs?<br />Give us a call at 419-887-2525 or 1-800-462-3589 (TTY: 1-888-740-5670) to review your medications with a Medicare representative and see which of our plans is a good fit for you.<br />We are available for phone calls from 8 a.m. to 8 p.m., Monday through Friday. From Oct. 1 to March 31, we are available 8 a.m. to 8 p.m., seven days per weeks. Or, come to one of our Medicare workshops and talk face-to-face with an expert.<br />Paramount Elite has an HMO Plan and a PPO Plan each plan with a Medicare contract. Enrollment in Paramount Elite (HMO) or Paramount Elite PPO Plan depends on contract renewal.<br />"
    }
  },
  {
    "id": 8,
    "title": "Medicare Plans | Medicare Star Ratings",
    "url": "https://www.paramounthealthcare.com/medicare/2023/educational-articles/do-medicare-star-ratings-really-matter",
    "metaTags": [
      "<meta charset=\"utf-8\">",
      "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1, shrink-to-fit=no\">",
      "<meta http-equiv=\"X-UA-Compatible\" content=\"IE=edge,chrome=1\">",
      "<meta name=\"description\" content=\"Why are Medicare star ratings important? Learn more about Medicare star ratings.\">",
      "<meta name=\"pagetype\" content=\"ContentPage\">",
      "<meta property=\"og:title\" content=\"Medicare Plans | Medicare Star Ratings\">",
      "<meta property=\"og:type\" content=\"website\">",
      "<meta property=\"og:description\" content=\"Why are Medicare star ratings important? Learn more about Medicare star ratings.\">",
      "<meta itemprop=\"description\" content=\"Why are Medicare star ratings important? Learn more about Medicare star ratings.\">",
      "<meta property=\"og:url\" content=\"https://www.paramounthealthcare.com/medicare/2023/educational-articles/do-medicare-star-ratings-really-matter\">",
      "<meta property=\"og:locale\" content=\"en_US\">",
      "<meta name=\"robots\" content=\"index, follow\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">"
    ],
    "content": {
      "banner": "https://www.paramounthealthcare.com/assets/images/elite/five-stars-780x300.jpg",
      "bannerAlt": null,
      "body": "<br />Do Medicare star ratings really matter?<br />Absolutely. In fact, John Meier, MD, senior medical director at Paramount Health Care and board-certified in family medicine, encourages those just entering Medicare or shopping for a new plan to consider more than just cost. 'It’s important for everyone, especially baby boomers who consider themselves healthy, to research more than just how much a plan costs. You have to look at things like the quality of the providers, member satisfaction and the plan’s customer service.'<br />Fortunately, Medicare star ratings can help with all of that.<br />If you’ve narrowed down your plans to a few with similar cost and coverage (that is, you know the plans include your doctors, offer your prescriptions and cover you when you’re out of state), then star ratings can be an extremely helpful way to home in on the plan that’s best for you.<br />What makes them so enlightening?<br />First, star ratings let you see how current members rate the plans you’re considering. Second, they shed light on how each plan performed in various areas. Finally, they can help you choose a highly rated plan, since all plans are evaluated on the exact same criteria.<br />How many stars can a Medicare plan receive?<br />All plans are rated on a scale from 1 to 5, 1 being poor and 5 being excellent.<br /> Excellent<br /> Above Average<br /> Average<br /> Below Average<br /> Poor<br />How are Medicare Advantage plans rated?<br />Staying healthy<br /> This includes things like screening tests, vaccines, flu shots, checkups and reported improvements in physical health over a two-year period.<br />Managing chronic conditions<br /> This looks at how often members with certain chronic conditions, like diabetes or high blood pressure, received tests and recommended treatments to help them manage their long-term condition.<br />Member experience with the health plan<br /> This is how members rated their overall satisfaction with the plan.<br />Member complaints and changes in the health plan’s performance<br /> This looks at how often members had problems with the plan and/or chose to leave the plan, and if and how much the plan improved.<br />Health plan customer service<br /> Personalized and responsive service is important to many Medicare members, and this rating addresses how well member services handles member calls, questions and requests.<br />How are Part D (prescription) plans rated?<br />Drug plan customer service<br /> This rating addresses how well member services handles member calls, questions and requests.<br />Member complaints and changes in the drug plan’s performance<br /> This looks at how often members had problems with the plan and/or chose to leave the plan, and if and how much the plan improved.<br />Member experience with the drug plan<br /> This is how members rated their overall satisfaction with the plan.<br />Drug safety and accuracy of drug pricing<br /> This category is reflective of how accurate the plan’s pricing is and how often members with medical conditions are prescribed drugs in a way that is safer and clinically recommended for their specific condition.<br />Plans that cover both health and drug services (Medicare Advantage plans with prescription drug coverage) receive an overall rating for quality and performance that includes all of these criteria.<br />Need a Medicare plan that’s right for you?<br />Paramount Elite Medicare offers a variety of Medicare Advantage plans and we’re happy to help you find one that fits your health needs, lifestyle and budget. Call us at <a href='tel:+14198872525'>419-887-2525</a> or <a href='tel:+18335542335'>833-554-2335</a> (TTY: <a href='tel:+18887405670'>888-740-5670</a>). We are available for phone calls 8 a.m. to 8 p.m., Monday through Friday. From Oct. 1 to March 31, we are available 8 a.m. to 8 p.m., seven days a week. Or, visit us online at paramounthealthcare.com/medicareplans.<br />Y0140_2022StarRatingArticle_M Accepted<br />"
    }
  },
  {
    "id": 9,
    "title": "Medicare Advantage Plans | Five reasons to select a Medicare Advantage plan",
    "url": "https://www.paramounthealthcare.com/medicare/2023/educational-articles/five-reasons-to-join-a-medicare-advantage-plan",
    "metaTags": [
      "<meta charset=\"utf-8\">",
      "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1, shrink-to-fit=no\">",
      "<meta http-equiv=\"X-UA-Compatible\" content=\"IE=edge,chrome=1\">",
      "<meta name=\"description\" content=\"What is a Medicare Advantage plan? Learn more about selecting a Medicare Advantage plan. Paramount Elite offers Medicare Advantage plans to our Medicare members.\">",
      "<meta name=\"pagetype\" content=\"ContentPage\">",
      "<meta property=\"og:title\" content=\"Medicare Advantage Plans | Five reasons to select a Medicare Advantage plan\">",
      "<meta property=\"og:type\" content=\"website\">",
      "<meta property=\"og:description\" content=\"What is a Medicare Advantage plan? Learn more about selecting a Medicare Advantage plan. Paramount Elite offers Medicare Advantage plans to our Medicare members.\">",
      "<meta itemprop=\"description\" content=\"What is a Medicare Advantage plan? Learn more about selecting a Medicare Advantage plan. Paramount Elite offers Medicare Advantage plans to our Medicare members.\">",
      "<meta property=\"og:url\" content=\"https://www.paramounthealthcare.com/medicare/2023/educational-articles/five-reasons-to-join-a-medicare-advantage-plan\">",
      "<meta property=\"og:locale\" content=\"en_US\">",
      "<meta name=\"robots\" content=\"index, follow\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">"
    ],
    "content": {
      "banner": null,
      "bannerAlt": null,
      "body": "<br />5 Reasons to Join a Medicare Advantage Plan<br />Choosing a Medicare Advantage plan<br />We understand that choosing the right Medicare plan can be a confusing task, with so many options to consider. You may be familiar with Original Medicare, which includes Medicare Part A (hospital coverage) and Part B (medical coverage). But, there's an option that goes beyond what Original Medicare has to offer – a Medicare Advantage plan.<br />Learn more about Paramount Elite Medicare Advantage plans <br />What is a Medicare Advantage plan?<br />A Medicare Advantage plan, also known as Medicare Part C or an MA plan, takes the place of your Original Medicare coverage. It also provides additional benefits not included by Original Medicare, offering more comprehensive healthcare coverage for you. If you're enrolled in Medicare Part A and Part B, you're qualified to enroll in a Medicare Advantage plan.*<br />Benefits of a Medicare Advantage plan<br />So, how do Medicare Advantage plans work? They are offered by private insurance companies that are approved by Medicare. Once you join the plan, you pay the private insurance company directly, and they work with Medicare to ensure your healthcare coverage is handled. While healthcare benefits vary from plan to plan, Medicare Advantage plans provide a variety of key overall benefits:<br />Benefits coverage: A Medicare Advantage plan covers all the benefits of Medicare Part A and Part B, plus many also include prescription drug, dental, hearing and vision benefits, as well as fitness programs like SilverSneakers®. A Medicare Advantage plan allows for more comprehensive healthcare coverage, in addition to keeping you protected in case of unexpected illness or injury.<br />Convenience: A Medicare Advantage plan allows you to choose your benefits through a private insurance provider, giving you the convenience of a single plan and a 'one-stop-shop' for all your medical and prescription drug coverage. Maximum out-of-pocket: Each plan offers a maximum out-of-pocket on how much you will spend on health expenses, and once the limit is reached, your medical costs will be covered in full. This is a benefit to those who know they will have a high number of medical expenses they'll need to handle.<br />Emergency Care/Urgent Care: Medicare Advantage plans must offer emergency and urgent care coverage outside the plan's service area throughout the United States, meaning you'll be covered nationwide.<br />Familiarity: If you've been on an employer health insurance plan, a Medicare Advantage plan works in a comparable way. You'll have the comfort of better understanding your health insurance plan because it works like employer-provided (commercial) health insurance. You'll still see deductibles, coinsurance, physician networks and other elements you're used to with health insurance.<br />Discover hassle-free Medicare with Paramount Elite<br />Because Paramount Elite (HMO/PPO) is a Medicare-approved health maintenance organization (HMO), we can offer a variety of Medicare Advantage plans as flexible healthcare options. Be sure to compare our Medicare plan offerings and determine which one fits your lifestyle and budget best.<br />Have additional questions? Give us a call: <a href='tel:+14198872525'>419-887-2525</a> | <a href='tel:+18335542335'>833-554-2335</a> | TTY <a href='tel:+18887405670'>888-740-5670</a>. We are available for phone calls 8:00 a.m. to 8:00 p.m., Monday through Friday. From October 1 to March 31, we are available 8:00 a.m. to 8:00 p.m., 7 days per week.<br />You can also attend one of our Medicare workshops to ask your questions in person.<br />*You must live in the service area of the plan. You must also continue to pay your Medicare Part B premium.<br />Paramount Elite is an HMO and a PPO plan with a Medicare contract. Enrollment in Paramount Elite (HMO/PPO) depends on contract renewal.<br />Y0140_20225ReasonsArticle_M Accepted<br />"
    }
  },
  {
    "id": 10,
    "title": "Medicare Plans | Medicare Plans with SilverSneakers",
    "url": "https://www.paramounthealthcare.com/medicare/2023/educational-articles/heres-why-medicare-plans-with-silversneakers-are-so-popular",
    "metaTags": [
      "<meta charset=\"utf-8\">",
      "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1, shrink-to-fit=no\">",
      "<meta http-equiv=\"X-UA-Compatible\" content=\"IE=edge,chrome=1\">",
      "<meta name=\"description\" content=\"Select a Medicare plan with SilverSneakers. SliverSneakers is a Medicare benefit.\">",
      "<meta name=\"pagetype\" content=\"ContentPage\">",
      "<meta property=\"og:title\" content=\"Medicare Plans | Medicare Plans with SilverSneakers\">",
      "<meta property=\"og:type\" content=\"website\">",
      "<meta property=\"og:description\" content=\"Select a Medicare plan with SilverSneakers. SliverSneakers is a Medicare benefit.\">",
      "<meta itemprop=\"description\" content=\"Select a Medicare plan with SilverSneakers. SliverSneakers is a Medicare benefit.\">",
      "<meta property=\"og:url\" content=\"https://www.paramounthealthcare.com/medicare/2023/educational-articles/heres-why-medicare-plans-with-silversneakers-are-so-popular\">",
      "<meta property=\"og:locale\" content=\"en_US\">",
      "<meta name=\"robots\" content=\"index, follow\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">",
      "<meta http-equiv=\"origin-trial\" content=\"A751Xsk4ZW3DVQ8WZng2Dk5s3YzAyqncTzgv+VaE6wavgTY0QHkDvUTET1o7HanhuJO8lgv1Vvc88Ij78W1FIAAAAAB7eyJvcmlnaW4iOiJodHRwczovL3d3dy5nb29nbGV0YWdtYW5hZ2VyLmNvbTo0NDMiLCJmZWF0dXJlIjoiUHJpdmFjeVNhbmRib3hBZHNBUElzIiwiZXhwaXJ5IjoxNjgwNjUyNzk5LCJpc1RoaXJkUGFydHkiOnRydWV9\">"
    ],
    "content": {
      "banner": null,
      "bannerAlt": null,
      "body": "<br />Here's why Medicare plans with SilverSneakers are so popular<br />If you’re new to Medicare, you might be wondering, “What is SilverSneakers®?” Well, it’s a fitness program for seniors that comes with qualifying Medicare health plans and provides access to thousands of fitness locations across the country.<br />From weights and machines to group classes led by trained instructors, SilverSneakers has something for everyone at all levels of ability.<br />What's so great about SilverSneakers?<br />15,000 locations<br /> There are over 15,000 locations nationwide1, and you can enroll at multiple locations. In fact, you have access to every single participating gym and fitness center in the network. If you want to work out at a handful of local gyms, you can. If you prefer one location near your winter residence and one location near your summer residence, that’s okay, too. It’s also great for people who want to stay fit while they travel.<br />Fitness equipment<br /> There’s no need to invest in a home gym when you have access to treadmills, stationary bikes, rowing machines, elliptical machines, stair climbers, weightlifting machines, free weights and more. Some locations even have pools, tennis courts and walking tracks.<br />Exclusive classes<br /> You also have access to a variety of exclusive classes2, which range from high intensity to low impact and everything in between. Plus, they’re designed for seniors and take your fitness level and ability into consideration. Classes include SilverSneakers Classic, SilverSneakers Circuit, SilverSneakers CardioFit, SilverSneakers Yoga, SilverSneakers Splash, SilverSneakers Stability®, WATERinMOTION, SilverSneakers BOOM&amp;trade MUSCLE, MIND and MOVE. Read class descriptions here.<br />SilverSneakers FLEX®<br /> SilverSneakers FLEX classes have a small student-to-teacher ratio and are led by trained instructors. The best part? These classes give you a chance to stay active outside the gym, as they’re located in the community. Think yoga at a recreation center or boot camp in the park.<br />SilverSneakers GO™ app<br /> This new app helps you find and design a workout that’s right for you. It also lets you schedule workouts, find locations and classes, log your workouts, track your progress and more.<br />SilverSneakers CollegeSave3<br /> This unique program lets SilverSneakers members earn thousands of dollars for college tuition, which you can give to extended family members. It’s simple. The more you work out, the more Tuition Rewards money you earn.<br />Social networking and online resources<br />Three of every four active members – 75% – say they have friends in the program or have made friends through SilverSneakers. Feeling a part of a community like this has its own health benefits. Plus, you can access online fitness and nutrition information.<br />Health benefits <br />SilverSneakers can help you reach and maintain a healthy body weight, increase muscle strength and bone density, become more flexible, improve your balance and memory, and even prevent, delay or treat certain medical conditions.4<br />No additional cost<br /> While SilverSneakers isn’t covered by Original Medicare, Part A or Part B, it is a common benefit if you have a Medicare Advantage plan. In fact, all Paramount Elite Medicare plans include SilverSneakers at no additional cost.<br />Learn more about Parmount Elite <br />Does your Medicare plan have SilverSneakers?<br />If your plan doesn’t include SilverSneakers and you’re interested in one that does, or if you’re not sure if your non-Paramount Medicare plan will offer SilverSneakers in 2021, give us a call at 419-887-2525 or 1-800-462-3589 (TTY: 1-888-740-5670). Also, if your non-Paramount Medicare plan has SilverSneakers, make sure that partnership will continue in the future. Not all plans will.<br /><a target='_blank' href='https://www.silversneakers.com/'>Learn more about Silver Sneakers </a><br />We are available for phone calls from 8:00 a.m. to 8:00 p.m., Monday through Friday. From October 1 to March 31, we are available 8:00 a.m. to 8:00 p.m., 7 days per week. Or, come to one of our Medicare workshops and talk face-to-face with an expert.<br />Paramount Elite is an HMO plan with a Medicare contract. Enrollment in Paramount Elite depends on contract renewal.<br />SilverSneakers, SilverSneakers FLEX and SilverSneakers Stability are registered trademarks of Tivity Health, Inc. SilverSneakers BOOM and SilverSneakers GO are trademarks of Tivity Health, Inc.<br />Always talk with your doctor before starting an exercise program.<br />Participating locations (“PL”) are not owned or operated by Tivity Health, Inc. or its affiliates. Use of PL facilities and amenities is limited to terms and conditions of PL basic membership. Facilities and amenities vary by PL.<br />Membership includes SilverSneakers instructor-led group fitness classes. Some locations offer members additional classes. Classes vary by location.<br />Students must be admitted to one of the participating colleges on standard admission criteria. Students use the Tuition Rewards® Points for discounts off full tuition in four equal installments from freshman to senior year of college. The tuition savings benefit is provided as a discount off tuition by each college; schools sign contracts with the program’s college network administrator to accept the Tuition Rewards (it is never paid in cash to a participating student or family). All students in the member’s extended family are eligible, from birth to the beginning of the junior year of high school; members can name their child, stepchild, niece, nephew, cousin, godchild or grandchild as a beneficiary of the Tuition Rewards discounts. There is no requirement for students to select a college they will attend in advance. The Tuition Rewards Points represent a guaranteed minimum scholarship that can be combined with other aid offered by the participating college. Each point equals $1.00 in tuition discounts. Additional requirements, including deadlines for registering students in the program and procedures for redemption of tuition discounts are provided in the CollegeSave Membership Terms and Conditions on the program membership portal.<br /><a href='https://www.nia.nih.gov/health/exercise-physical-activity' target='_blank'>NIA.NIH.GOV</a><br />"
    }
  }
]